[
  {
    "id": 1,
    "titulo": "JavaScript: O Que Você Não Sabia",
    "texto": "> Fonte: [Rocketseat](https://blog.rocketseat.com.br/node-js-e-a-revolucao-do-desenvolvimento-web/) \n\n ### Introdução\n\n Node.JS é uma ferramenta amplamente utilizada no universo de desenvolvimento e todos que atuam na área de tecnologia já ouviram falar, nem que seja nos milhares de anúncios de cursos ou mesmo de vagas. Mas você se pergunta: afinal, o que é Node.js? Para que serve? Como ele atua?\n\n Calma que, antes de olhar para o ambiente Node.JS, precisamos entender um pouco sobre o que é o JavaScript e como ele funciona. Vamos lá!\n\n ### Node.JS e JavaScript\n\n JavaScript é uma linguagem de programação que originalmente foi desenvolvida para trazer maior interatividade aos websites através da manipulação do DOM (Document Object Model). Vamos conferir a definição do livro que é uma referência na temática, o Eloquent JavaScript.\n\n O JavaScript foi introduzido em 1995 como uma forma de adicionar dinamicidade às páginas da web no navegador Netscape Navigator. Desde então, a linguagem foi adotada por todos os outros principais navegadores gráficos da web. Ela tornou possíveis o desenvolvimento das aplicações modernas da web - aplicações com as quais você pode interagir diretamente sem recarregar a página a cada ação. JavaScript também é usado em sites mais tradicionais para fornecer várias formas de interatividade de forma mais inteligente.\n\n Fonte: Tradução livre do livro Eloquent JavaScript.\n\n Portanto, de forma resumida, podemos entender que o JavaScript foi pensado para ser rápido, dinâmico e acessível. A linguagem interpretada possibilita subir ou trabalhar em suas aplicações sem precisar configurar todo um ambiente complexo.\n\n Essas características motivaram o engenheiro de software Ryan Dahl a desenvolver um ambiente, como um programa que você instala no seu computador, que trabalha com a linguagem JavaScript fora do navegador e pelo lado do servidor, via terminal, de uma maneira menos restritiva.\n\n ### Tudo bem, mas e o Node.JS?\n\n O JavaScript nasceu para atender demandas voltadas ao Front-End e, como as necessidades aumentam de acordo com o crescimento tecnológico, surgiu a ideia de utilizar uma mesma linguagem no lado do cliente e do servidor para otimizar processos e serviços. Dessa forma, o Node.JS aparece como uma alternativa viável para programação Back-End por se tratar de um ambiente para desenvolvimento utilizando a linguagem JavaScript.\n\n De acordo com sua definição oficial, o Node é um runtime, que nada mais é do que um conjunto de códigos, APIs, ou seja, são bibliotecas responsáveis pelo tempo de execução (é o que faz o seu programa rodar) que funciona como um interpretador de JavaScript fora do ambiente do navegador web.\n\n É importante frisar que o Node.JS é um ambiente de execução assíncrono, isto é, ele trabalha de modo a não bloquear no momento da execução da aplicação, delegando os processos demorados a um segundo plano.\n\n Ele dá muito certo com os servidores de arquitetura “single-threaded”, isto significa que todos os pedidos para o servidor são executados no mesmo tópico - em vez de serem gerados em processos separados. Um dos grandes diferenciais da parceria Node.JS e JavaScript é o bom desempenho no uso de APIs, já que o JavaScript faz bastante uso de APIs assíncronas.\n\n Você deve estar se perguntando: “Beleza, já entendi o que é o Node.JS e seu diferencial quando o assunto é o seu uso com o JavaScript, mas o que isso significa?” Vamos entender um pouco mais... vem comigo, que te explico...\n\n ### Como o Node.JS funciona\n\n O Node é capaz de interpretar um código JavaScript, igual ao que o navegador faz. Sendo assim, quando o navegador recebe um comando em JavaScript, ele o interpreta e depois executa as instruções fornecidas.\n\n O Node é fantástico (totalmente “sem parcialidade”, aqui pessoal, juro!) porque torna possível o envio de instruções (os nossos códigos) sem precisar de um navegador ativo, basta ter o Node.JS instalado e utilizar o terminal para executar um programa construído em JavaScript.\n\n Além disso, você pode utilizar apenas uma linguagem de programação para tratar requisições entre cliente e servidor. Sensacional, não é?\n\n Para que todo esse processo seja possível de ocorrer fora do navegador, o Node utiliza uma outra ferramenta chamada Chrome's V8 JavaScript Engine. É esse motor V8 do Chrome que compila e executa o código JavaScript no lugar de apenas interpretá-lo.\n\n *Ainda parece muito confuso? Vem comigo que te explico melhor…*\n\n O motor V8 da Google é o centro, o coração que processa todo o código JavaScript do navegador para que sua máquina compreenda e disponibilize os recursos e interações. Só é possível visualizar páginas em JavaScript ou trabalhar com um código pelo Node.JS devido ao processamento do motor V8 do Chrome.\n\n Graças ao núcleo baseado em JavaScript e no motor V8 da Google, o Node.JS possui algumas características que, dependendo do cenário, podem ser consideradas como benefícios da plataforma, vamos conferir algumas.\n\n ### Características do Node.JS\n\n Node.JS pode ser utilizado nas famosas APIs Rest, web scraping, chatbots, IoT, web servers, aplicações Desktop, tudo devido à sua característica altamente versátil. Dentre as principais, podemos citar:\n\n - **Multiplataforma**: permite criar desde aplicativos desktop, aplicativos móveis e até sites SaaS.\n\n - **Multi-paradigma**: é possível programar em diferentes paradigmas, como: Orientado a Objetos, funcional, imperativo e dirigido a eventos.\n\n - **Open Source**: é uma plataforma de código aberto, isso significa que você pode ter acesso ao código fonte do Node.JS e realizar suas próprias customizações ou mesmo contribuir para a comunidade de forma direta.\n\n - **Escalável**: Node.JS foi criado para construir aplicações web escaláveis, como podemos ver na sua documentação oficial.\n\n O Node.JS ainda apresenta uma curva de aprendizado relativamente menor comparado a outras linguagens voltadas ao Back-End e possui uma comunidade gigante disposta a ajudar. E sem dúvida a união dessas forças é o super poder do Node.JS.\n\n ### Empresas que usam Node.JS\n\n Tudo bem, falamos das inúmeras qualidades do Node.JS mas, na prática… onde eu posso trabalhar com a ferramenta?\n\n Por conta dos super-poderes do Node.JS, uma gama de gigantes no mercado atua diretamente com a plataforma em suas regras de negócio, confere só a listinha de algumas:\n\n - **Netflix**: substituiu o renderizador baseado em Java pelo de JavaScript com Node.JS para diminuir o tempo de espera nas requisições dos usuários e conseguiu uma redução de cerca de 1 minuto.\n\n - **IBM**: criou o The Canary in the Gold Mine (CITGM), um utilitário de testes amplamente utilizado pela companhia.\n\n - **LinkedIn**: o aplicativo mobile da maior rede profissional é construído em Node e HTML5, você pode conferir a matéria na íntegra [aqui](https://www.linkedin.com/).\n\n - **Uber**: sistema de relacionamento entre usuários e condutores foi construído em Node.JS por conta de sua rápida resposta.\n\n ### Meu primeiro código em Node.JS\n\n Para rodar a plataforma na sua máquina é necessário instalar o Node.JS. Caso você ainda não tenha, siga o tutorial Instalando o Node.JS no [Windows](https://nodejs.org/en/download/) e [Linux](https://nodejs.org/en/download/package-manager/).\n\n E depois colocar a mão no código. Aquele “Hello World!” para dar sorte:\n\n ```javascript\n console.log('Hello, World!')\n```\n\n E agora você pode subir seu primeiro servidor:\n\n ```javascript\n const http = require('http');\n\n const server = http.createServer(function (req, res) {\n\n res.writeHead(200, {'Content-type': 'text/html'});\n\n res.end('Hello Node!');\n\n });\n\n server.listen(3000);\n\n console.log('Servidor funcionando. Acesse: localhost:3000');\n```\n\n Ah, é importante lembrar que aqui o código está de acordo com a última versão estável, a versão LTS (Long-term support ou suporte de longo prazo, em português).\n"
  },
  {
    "id": 2,
    "titulo": "O que é Node?",
    "texto": "> Fonte: [TOTVS](https://www.totvs.com/blog/gestao-para-assinatura-de-documentos/jwt-token/)\n\n Você já foi em algum evento que precisou apresentar um documento de identificação para comprovar que você era realmente a pessoa que comprou o ingresso? O ato de solicitar o documento de identificação é uma forma de autenticação para que você receba a autorização para entrar. Na web, esse processo funciona de forma parecida. Para fazer requisições de alguns serviços ou acessar páginas específicas, você precisa se identificar de alguma forma, e essa identificação precisa ser segura e única.\n\n Neste artigo você vai compreender o que é o padrão JWT (sigla para “JSON Web Tokens”) para autenticação, muito usado na web. Também veremos:\n\n - O que é um token;\n\n - Para que serve e quando usar um JWT;\n\n - Como criar e verificar seu JWT.\n\n ### O que é um token?\n\n Atualmente, ouvimos muito a palavra token relacionada a NFTs (sigla para “Tokens não fungíveis”), metaverso, criptomoedas, etc. Porém, fora desse meio, um token é uma assinatura digital, uma chave.\n\n Quando você abre uma conta em um banco, você precisa definir uma senha e fornecer seus dados pessoais. Esses dados são convertidos em uma assinatura digital que vai identificar você de forma única para aquele banco e, toda vez que você acessar seu banco e entrar com sua senha e um dado pessoal, o banco entenderá e confirmará que você é aquele usuário logado, semelhante a entrarmos no evento quando apresentamos nosso documento de identidade.\n\n Existem vários algoritmos e padrões que transformam suas informações em um token, isto é, uma chave de autenticação única, que faz sentido para o serviço ou aplicação que você está tentando acessar. Um desses padrões é o JWT, que é seguro por permitir uma autenticação entre duas partes através de um token assinado.\n\n ### O que é JWT?\n\n Um JWT é um padrão para autenticação e troca de informações definido pela RFC7519. Nele é possível armazenar de forma segura e compacta objetos JSON. Este token é um código Base64 e pode ser assinado usando um segredo ou par de chaves privadas/públicas.\n\n Tokens assinados podem verificar a integridade das informações contidas neles, diferente de tokens criptografados que ocultam essas informações. Se um JWT é assinado por um par de chaves pública/privada, a assinatura certifica que a parte que possui a chave privada é quem de fato assinou.\n\n ### Quando e onde eu posso usar um JWT?\n\n Você pode usar, por exemplo, em um cenário de autorização. Depois que o usuário estiver conectado, é possível observar cada solicitação e verificar se esta inclui o JWT, permitindo que o usuário acesse rotas, serviços e outros recursos.\n\n Outro cenário de utilização de JWTs são as trocas de informações, pois, como eles são assinados, é possível ter certeza de que os remetentes são quem dizem ser. Além disso, podemos identificar se o conteúdo da assinatura foi alterado ou não devido à composição de um JWT.\n\n ### Como surgiu o JWT?\n\n Ele faz parte de uma família de especificações: a família JOSE.\n\n JOSE significa JSON Object Signing and Encryption, em português Assinatura e criptografia de objetos JSON. O JWT faz parte dessa família de especificações e representa o token. Abaixo, você confere outras especificações desta família:\n\n - **JWT (JSON Web Tokens)**: representa o token propriamente dito;\n\n - **JWS (JSON Web Signature)**: representa a assinatura do token;\n\n - **JWE (JSON Web Encryption)**: representa a assinatura para criptografia do token;\n\n - **JWK (JSON Web Keys)**: representa as chaves para a assinatura;\n\n - **JWA (JSON Web Algorithms)**: representa os algoritmos para assinatura do token.\n\n Agora que você já sabe o que é, para que serve e quando usar um JWT, vamos entender mais a fundo como funciona e quais os componentes de um JWT. Vem comigo!\n\n ### Componentes básicos de um JSON Web Token\n\n Um JWT possui uma estrutura básica composta pelo header, payload e a signature. Essas três partes são separadas por pontos ( . ). Dessa forma, seria algo do tipo: header.payload.signature. Vamos entender melhor cada uma dessas partes!\n\n #### Header\n\n Header é o cabeçalho do token onde passamos basicamente duas informações: o alg que informa qual algoritmo é usado para criar a assinatura e o typ que indica qual o tipo de token.\n\n ```json\n { \n \"alg\": \"HS256\", \n \"typ\": \"JWT\" \n } \n```\n\n #### Payload\n\n O payload é o componente onde podemos encontrar os dados referentes à autenticação como senha e email, por exemplo.\n\n ```json\n { \n \"email\": \"nome@diego.com.br\", \n \"password\": \"HuEKW489!j445*\" \n } \n```\n\n #### Signature\n\n A assinatura do token (signature) é composta pela codificação do header e do payload somada a uma chave secreta e é gerada pelo algoritmo especificado no cabeçalho.\n\n ```javascript\n HS256SHA256( \n base64UrlEncode(header) + \".\" + base64UrlEncode(payload), secret_key) \n```\n\n O resultado são três strings separadas por pontos que podem ser facilmente utilizadas em ambientes HTML e protocolos HTTP.\n\n ```text\n eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9. \n eyJzdWIiOiIxMjM0NTY3ODkwIiwibmFtZSI6IkpvaG4gRG9lIiwiaWF0IjoxNTE2MjM5MDIyfQ. \n SflKxwRJSMeKKF2QT4fwpMeJf36POk6yJV_adQssw5c \n```\n\n Agora que entendemos como é “por dentro” um JWT vamos criar nosso próprio JSON Web Token!\n\n ### Criando um JWT\n\n Para começar, vamos criar uma pasta chamada jwt no diretório que você desejar. Crie um arquivo JavaScript com o nome que escolher, eu estou utilizando index.js. Faça a instalação da lib JWT que escolher. Existem diversas libs que ajudam na geração de JWTs. Irei utilizar a jsonwebtoken que é uma das mais populares, mas você pode ficar à vontade para explorar outras opções.\n\n O primeiro passo é importar a lib no nosso arquivo:\n\n ```javascript\n const jwt = require('jsonwebtoken'); \n```\n\n Agora criamos a nossa chave secreta. A ideia é que só você saiba a sua chave secreta e que ela seja difícil a fim de dificultar a ação de ataques maliciosos. A minha ficou desse jeito:\n\n ```javascript\n const secretKey = 'skljaksdj9983498327453lsldkjf'; \n```\n\n Feito isso, vamos criar nosso token utilizando o método sign. Este método aceita como parâmetros o payload, a chave secreta e o header, nesta ordem.\n\n ```javascript\n const nossoToken = jwt.sign( \n { \n email: 'nome@diego.com.br', \n password: 'HuEKW489!j445*', \n }, \n secretKey, \n { \n expiresIn: '1y', \n subject: '1', \n } \n); \n```\n\n Para este JWT, eu estou informando um email e senha no payload; minha chave secreta; e no header estou informando um subject, que na biblioteca deste exemplo funciona como um id. Além disso, estou dizendo que nosso token expira em 1 ano. Por padrão, o algoritmo de codificação é o HS256.\n\n Para visualizar a saída em nosso terminal, utilizei a biblioteca Nodemon que você pode instalar e ver como funciona acessando este link. O nodemon é uma ferramenta que ajuda a desenvolver aplicativos baseados em Node.js, reiniciando automaticamente o aplicativo quando são detectadas alterações de arquivo no diretório.\n\n Podemos ver nosso token gerado passando a variável nossoToken em um console.log:\n\n ```javascript\n console.log(nossoToken); \n```\n\n A saída deve ser:\n\n ```text\n eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJlbWFpbCI6Im5vbWVAYWx1cmEuY29tLmJyIiwicGFzc3dvcmQiOiJIdUVLVzQ4OSFqNDQ1KiIsImlhdCI6MTY1MTY4MzUxNywiZXhwIjoxNjgzMjQxMTE3LCJzdWIiOiIxIn0.t0UuIAxJ1NPXANtlBOKfHfLsePF4LRPu4RA2WMkJl6A \n```\n\n ### Verificando nosso JWT\n\n Para verificar nosso token podemos utilizar um método da própria biblioteca jsonwebtoken chamado decode passando o token gerado.\n\n ```javascript\n const tokenGerado = 'eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJlbWFpbCI6Im5vbWVAYWx1cmEuY29tLmJyIiwicGFzc3dvcmQiOiJIdUVLVzQ4OSFqNDQ1KiIsImlhdCI6MTY1MTY4MzUxNywiZXhwIjoxNjgzMjQxMTE3LCJzdWIiOiIxIn0.t0UuIAxJ1NPXANtlBOKfHfLsePF4LRPu4RA2WMkJl6A'; \n\n console.log(jwt.decode(tokenGerado)); \n```\n\n A saída deste código é:\n\n ```json\n { \n email: 'nome@diego.com.br', \n password: 'HuEKW489!j445*', \n iat: 1651683517, \n exp: 1683241117, \n sub: '1' \n } \n```\n\n Onde os parâmetros iat, exp e sub são, respectivamente, as datas de criação e expiração, no formato UTC, em que o token foi criado e em que expirará, e o subject que passamos no nosso código com valor 1. Outra alternativa para verificar nosso token é acessando o link: [https://jwt.io/](https://jwt.io/). Neste caso, só precisamos passar o token gerado e iremos visualizar as informações decodificadas.\n\n Agora, você deve estar se perguntando: “Agora que eu sei o que é e como funciona um JSON Web Token, como usá-lo em minhas aplicações front-end?”\n\n Vamos descobrir!\n\n ### Autenticação com tokens\n\n Imagine que você é uma pessoa desenvolvedora e está criando o front-end de uma aplicação para um banco. Na página de login você pega os dados dos usuários e envia esses dados para uma API utilizando o fetch ou axios, por exemplo.\n\n ```javascript\n fetch(`${baseUrl}/auth/login`, { \n method: 'POST', \n headers: { \n 'Content-Type': 'application/json', \n }, \n body: JSON.stringify(usuario), \n }) \n .then((resposta) => { \n ...alguma coisa \n }) \n .catch((erro) => { \n ...alguma coisa \n }); \n```\n\n O servidor irá pegar esses dados e, por meio de uma lógica, irá retornar um token que vai identificar aquele usuário. Agora, toda vez que este usuário logar na plataforma, ele passará por uma autenticação e, se estiver tudo certo com os dados, será autorizado a acessar determinadas áreas da aplicação, como ver o saldo. Geralmente essa codificação e geração de tokens é realizada pelo back-end, mas você precisará garantir que este usuário logado possa continuar acessando outras áreas da aplicação.\n\n Você também pode salvar o token na session storage ou local storage do seu navegador, para garantir que, enquanto o token não expirar, o usuário permaneça logado na aplicação. Além disso, é importante que, ao efetuar o login, o usuário seja redirecionado para uma página Home, onde ele poderá ver outras funcionalidades da aplicação.\n\n Quando este usuário tentar acessar a página que mostra o seu saldo, por exemplo, você pode fazer uma requisição, usando axios ou fetch passando no headers um campo “Authorization” com o token gerado. Isso irá fazer com que o servidor verifique se o usuário tem permissão ou não de acessar aquela página específica.\n\n ```javascript\n fetch(`${baseUrl}/saldo`, { \n headers: { \n 'Authorization': `Bearer ${token}`, \n }, \n }) \n .then((resposta) => { \n ...alguma coisa \n }) \n .catch((erro) => { \n ...alguma coisa \n }); \n```\n\n Quando o usuário fizer logout na nossa aplicação, você pode redirecioná-lo para outra página, e quando o token expirar, você redireciona o usuário para a página de login novamente.\n\n ### Conclusão\n\n Quanta coisa legal, não é mesmo?\n\n Neste artigo, você entendeu o que são JSON Web Tokens, para que servem, quais seus componentes e como utilizá-los em suas aplicações. Você também viu como utilizar tokens em uma aplicação front-end para autenticação de usuários.\n"
  },
  {
    "id": 3,
    "titulo": "O que é JWT?",
    "texto": "> Fonte: [TOTVS](https://www.totvs.com/blog/gestao-para-assinatura-de-documentos/jwt-token/)\n\n Você já foi em algum evento que precisou apresentar um documento de identificação para comprovar que você era realmente a pessoa que comprou o ingresso? O ato de solicitar o documento de identificação é uma forma de autenticação para que você receba a autorização para entrar. Na web, esse processo funciona de forma parecida. Para fazer requisições de alguns serviços ou acessar páginas específicas, você precisa se identificar de alguma forma, e essa identificação precisa ser segura e única.\n\n Neste artigo você vai compreender o que é o padrão JWT (sigla para “JSON Web Tokens”) para autenticação, muito usado na web. Também veremos:\n\n - O que é um token;\n\n - Para que serve e quando usar um JWT;\n\n - Como criar e verificar seu JWT.\n\n ### O que é um token?\n\n Atualmente, ouvimos muito a palavra token relacionada a NFTs (sigla para “Tokens não fungíveis”), metaverso, criptomoedas, etc. Porém, fora desse meio, um token é uma assinatura digital, uma chave.\n\n Quando você abre uma conta em um banco, você precisa definir uma senha e fornecer seus dados pessoais. Esses dados são convertidos em uma assinatura digital que vai identificar você de forma única para aquele banco e, toda vez que você acessar seu banco e entrar com sua senha e um dado pessoal, o banco entenderá e confirmará que você é aquele usuário logado, semelhante a entrarmos no evento quando apresentamos nosso documento de identidade.\n\n Existem vários algoritmos e padrões que transformam suas informações em um token, isto é, uma chave de autenticação única, que faz sentido para o serviço ou aplicação que você está tentando acessar. Um desses padrões é o JWT, que é seguro por permitir uma autenticação entre duas partes através de um token assinado.\n\n ### O que é JWT?\n\n Um JWT é um padrão para autenticação e troca de informações definido pela RFC7519. Nele é possível armazenar de forma segura e compacta objetos JSON. Este token é um código Base64 e pode ser assinado usando um segredo ou par de chaves privadas/públicas.\n\n Tokens assinados podem verificar a integridade das informações contidas neles, diferente de tokens criptografados que ocultam essas informações. Se um JWT é assinado por um par de chaves pública/privada, a assinatura certifica que a parte que possui a chave privada é quem de fato assinou.\n\n ### Quando e onde eu posso usar um JWT?\n\n Você pode usar, por exemplo, em um cenário de autorização. Depois que o usuário estiver conectado, é possível observar cada solicitação e verificar se esta inclui o JWT, permitindo que o usuário acesse rotas, serviços e outros recursos.\n\n Outro cenário de utilização de JWTs são as trocas de informações, pois, como eles são assinados, é possível ter certeza de que os remetentes são quem dizem ser. Além disso, podemos identificar se o conteúdo da assinatura foi alterado ou não devido à composição de um JWT.\n\n ### Como surgiu o JWT?\n\n Ele faz parte de uma família de especificações: a família JOSE.\n\n JOSE significa JSON Object Signing and Encryption, em português Assinatura e criptografia de objetos JSON. O JWT faz parte dessa família de especificações e representa o token. Abaixo, você confere outras especificações desta família:\n\n - **JWT (JSON Web Tokens)**: representa o token propriamente dito;\n\n - **JWS (JSON Web Signature)**: representa a assinatura do token;\n\n - **JWE (JSON Web Encryption)**: representa a assinatura para criptografia do token;\n\n - **JWK (JSON Web Keys)**: representa as chaves para a assinatura;\n\n - **JWA (JSON Web Algorithms)**: representa os algoritmos para assinatura do token.\n\n Agora que você já sabe o que é, para que serve e quando usar um JWT, vamos entender mais a fundo como funciona e quais os componentes de um JWT. Vem comigo!\n\n ### Componentes básicos de um JSON Web Token\n\n Um JWT possui uma estrutura básica composta pelo header, payload e a signature. Essas três partes são separadas por pontos ( . ). Dessa forma, seria algo do tipo: header.payload.signature. Vamos entender melhor cada uma dessas partes!\n\n #### Header\n\n Header é o cabeçalho do token onde passamos basicamente duas informações: o alg que informa qual algoritmo é usado para criar a assinatura e o typ que indica qual o tipo de token.\n\n ```json\n { \n \"alg\": \"HS256\", \n \"typ\": \"JWT\" \n } \n```\n\n #### Payload\n\n O payload é o componente onde podemos encontrar os dados referentes à autenticação como senha e email, por exemplo.\n\n ```json\n { \n \"email\": \"nome@diego.com.br\", \n \"password\": \"HuEKW489!j445*\" \n } \n```\n\n #### Signature\n\n A assinatura do token (signature) é composta pela codificação do header e do payload somada a uma chave secreta e é gerada pelo algoritmo especificado no cabeçalho.\n\n ```javascript\n HS256SHA256( \n base64UrlEncode(header) + \".\" + base64UrlEncode(payload), secret_key) \n```\n\n O resultado são três strings separadas por pontos que podem ser facilmente utilizadas em ambientes HTML e protocolos HTTP.\n\n ```text\n eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9. \n eyJzdWIiOiIxMjM0NTY3ODkwIiwibmFtZSI6IkpvaG4gRG9lIiwiaWF0IjoxNTE2MjM5MDIyfQ. \n SflKxwRJSMeKKF2QT4fwpMeJf36POk6yJV_adQssw5c \n```\n\n Agora que entendemos como é “por dentro” um JWT vamos criar nosso próprio JSON Web Token!\n\n ### Criando um JWT\n\n Para começar, vamos criar uma pasta chamada jwt no diretório que você desejar. Crie um arquivo JavaScript com o nome que escolher, eu estou utilizando index.js. Faça a instalação da lib JWT que escolher. Existem diversas libs que ajudam na geração de JWTs. Irei utilizar a jsonwebtoken que é uma das mais populares, mas você pode ficar à vontade para explorar outras opções.\n\n O primeiro passo é importar a lib no nosso arquivo:\n\n ```javascript\n const jwt = require('jsonwebtoken'); \n```\n\n Agora criamos a nossa chave secreta. A ideia é que só você saiba a sua chave secreta e que ela seja difícil a fim de dificultar a ação de ataques maliciosos. A minha ficou desse jeito:\n\n ```javascript\n const secretKey = 'skljaksdj9983498327453lsldkjf'; \n```\n\n Feito isso, vamos criar nosso token utilizando o método sign. Este método aceita como parâmetros o payload, a chave secreta e o header, nesta ordem.\n\n ```javascript\n const nossoToken = jwt.sign( \n { \n email: 'nome@diego.com.br', \n password: 'HuEKW489!j445*', \n }, \n secretKey, \n { \n expiresIn: '1y', \n subject: '1', \n } \n); \n```\n\n Para este JWT, eu estou informando um email e senha no payload; minha chave secreta; e no header estou informando um subject, que na biblioteca deste exemplo funciona como um id. Além disso, estou dizendo que nosso token expira em 1 ano. Por padrão, o algoritmo de codificação é o HS256.\n\n Para visualizar a saída em nosso terminal, utilizei a biblioteca Nodemon que você pode instalar e ver como funciona acessando este link. O nodemon é uma ferramenta que ajuda a desenvolver aplicativos baseados em Node.js, reiniciando automaticamente o aplicativo quando são detectadas alterações de arquivo no diretório.\n\n Podemos ver nosso token gerado passando a variável nossoToken em um console.log:\n\n ```javascript\n console.log(nossoToken); \n```\n\n A saída deve ser:\n\n ```text\n eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJlbWFpbCI6Im5vbWVAYWx1cmEuY29tLmJyIiwicGFzc3dvcmQiOiJIdUVLVzQ4OSFqNDQ1KiIsImlhdCI6MTY1MTY4MzUxNywiZXhwIjoxNjgzMjQxMTE3LCJzdWIiOiIxIn0.t0UuIAxJ1NPXANtlBOKfHfLsePF4LRPu4RA2WMkJl6A \n```\n\n ### Verificando nosso JWT\n\n Para verificar nosso token podemos utilizar um método da própria biblioteca jsonwebtoken chamado decode passando o token gerado.\n\n ```javascript\n const tokenGerado = 'eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJlbWFpbCI6Im5vbWVAYWx1cmEuY29tLmJyIiwicGFzc3dvcmQiOiJIdUVLVzQ4OSFqNDQ1KiIsImlhdCI6MTY1MTY4MzUxNywiZXhwIjoxNjgzMjQxMTE3LCJzdWIiOiIxIn0.t0UuIAxJ1NPXANtlBOKfHfLsePF4LRPu4RA2WMkJl6A'; \n\n console.log(jwt.decode(tokenGerado)); \n```\n\n A saída deste código é:\n\n ```json\n { \n email: 'nome@diego.com.br', \n password: 'HuEKW489!j445*', \n iat: 1651683517, \n exp: 1683241117, \n sub: '1' \n } \n```\n\n Onde os parâmetros iat, exp e sub são, respectivamente, as datas de criação e expiração, no formato UTC, em que o token foi criado e em que expirará, e o subject que passamos no nosso código com valor 1. Outra alternativa para verificar nosso token é acessando o link: [https://jwt.io/](https://jwt.io/). Neste caso, só precisamos passar o token gerado e iremos visualizar as informações decodificadas.\n\n Agora, você deve estar se perguntando: “Agora que eu sei o que é e como funciona um JSON Web Token, como usá-lo em minhas aplicações front-end?”\n\n Vamos descobrir!\n\n ### Autenticação com tokens\n\n Imagine que você é uma pessoa desenvolvedora e está criando o front-end de uma aplicação para um banco. Na página de login você pega os dados dos usuários e envia esses dados para uma API utilizando o fetch ou axios, por exemplo.\n\n ```javascript\n fetch(`${baseUrl}/auth/login`, { \n method: 'POST', \n headers: { \n 'Content-Type': 'application/json', \n }, \n body: JSON.stringify(usuario), \n }) \n .then((resposta) => { \n ...alguma coisa \n }) \n .catch((erro) => { \n ...alguma coisa \n }); \n```\n\n O servidor irá pegar esses dados e, por meio de uma lógica, irá retornar um token que vai identificar aquele usuário. Agora, toda vez que este usuário logar na plataforma, ele passará por uma autenticação e, se estiver tudo certo com os dados, será autorizado a acessar determinadas áreas da aplicação, como ver o saldo. Geralmente essa codificação e geração de tokens é realizada pelo back-end, mas você precisará garantir que este usuário logado possa continuar acessando outras áreas da aplicação.\n\n Você também pode salvar o token na session storage ou local storage do seu navegador, para garantir que, enquanto o token não expirar, o usuário permaneça logado na aplicação. Além disso, é importante que, ao efetuar o login, o usuário seja redirecionado para uma página Home, onde ele poderá ver outras funcionalidades da aplicação.\n\n Quando este usuário tentar acessar a página que mostra o seu saldo, por exemplo, você pode fazer uma requisição, usando axios ou fetch passando no headers um campo “Authorization” com o token gerado. Isso irá fazer com que o servidor verifique se o usuário tem permissão ou não de acessar aquela página específica.\n\n ```javascript\n fetch(`${baseUrl}/saldo`, { \n headers: { \n 'Authorization': `Bearer ${token}`, \n }, \n }) \n .then((resposta) => { \n ...alguma coisa \n }) \n .catch((erro) => { \n ...alguma coisa \n }); \n```\n\n Quando o usuário fizer logout na nossa aplicação, você pode redirecioná-lo para outra página, e quando o token expirar, você redireciona o usuário para a página de login novamente.\n\n ### Conclusão\n\n Quanta coisa legal, não é mesmo?\n\n Neste artigo, você entendeu o que são JSON Web Tokens, para que servem, quais seus componentes e como utilizá-los em suas aplicações. Você também viu como utilizar tokens em uma aplicação front-end para autenticação de usuários.\n"
  },
  {
    "id": 4,
    "titulo": "Dicas Avançadas de CSS",
    "texto": "> Fonte: [MDN Web Docs](https://developer.mozilla.org/pt-BR/docs/Learn/Getting_started_with_the_web/CSS_basics)\n\n CSS é uma linguagem poderosa e versátil para estilização de páginas web, mas você sabe como tirar o máximo proveito dela? Aqui estão algumas dicas avançadas para melhorar seu domínio de CSS e criar layouts incríveis!\n\n ### Flexbox e Grid Layout\n\n Tanto o Flexbox quanto o Grid Layout são módulos de layout poderosos que permitem criar designs complexos de maneira simples e eficiente. Flexbox é ótimo para layouts unidimensionais, enquanto Grid é ideal para layouts bidimensionais.\n\n #### Exemplo de Flexbox\n\n ```css\n .container { \n display: flex; \n justify-content: center; \n align-items: center; \n height: 100vh; \n } \n```\n\n #### Exemplo de Grid Layout\n\n ```css\n .container { \n display: grid; \n grid-template-columns: repeat(3, 1fr); \n gap: 10px; \n } \n```\n\n ### Animações e Transições\n\n Adicionar animações e transições pode trazer vida e dinamismo ao seu site. O CSS oferece uma ampla gama de propriedades para criar efeitos suaves e atraentes.\n\n #### Exemplo de Transição\n\n ```css\n .button { \n background-color: #4CAF50; \n transition: background-color 0.3s ease; \n } \n\n .button:hover { \n background-color: #45a049; \n } \n```\n\n #### Exemplo de Animação\n\n ```css\n @keyframes example { \n from {background-color: red;} \n to {background-color: yellow;} \n } \n\n .element { \n animation-name: example; \n animation-duration: 4s; \n } \n```\n\n ### Variáveis de CSS\n\n As variáveis de CSS permitem armazenar valores que podem ser reutilizados em todo o documento. Elas são especialmente úteis para manter a consistência e facilitar a manutenção do código.\n\n #### Exemplo de Variáveis de CSS\n\n ```css\n :root { \n --main-color: #3498db; \n --secondary-color: #2ecc71; \n } \n\n .header { \n color: var(--main-color); \n } \n\n .footer { \n color: var(--secondary-color); \n } \n```\n\n ### Conclusão\n\n Dominar CSS pode levar algum tempo, mas com a prática e o conhecimento das técnicas avançadas, você pode criar designs impressionantes e funcionais.\n"
  },
  {
    "id": 5,
    "titulo": "Variáveis no CSS",
    "texto": "> Fonte: [MDN Web Docs](https://developer.mozilla.org/pt-BR/docs/Web/CSS/Using_CSS_custom_properties)\n\n Provavelmente, ao construir um website, você já deve ter reparado que muitos dos valores nos arquivos CSS são dados que se repetem constantemente, não é mesmo? Por exemplo, a paleta de cores que mantém o padrão visual da página é reutilizada em inúmeros pontos do código. Sendo assim, fazer a manutenção do projeto e alterar esses valores manualmente pode se tornar uma tarefa trabalhosa e passível de erros, ainda mais em aplicações de grande escala.\n\n Mas então, como podemos melhorar essa situação?\n\n Uma boa alternativa é utilizar as Variáveis no CSS como aliadas!\n\n Se você ficou interessado e deseja descobrir como fazer isso, vem comigo que nesse artigo eu te ensinarei mais sobre esse assunto detalhadamente.\n\n ### Mas primeiro, o que são Variáveis de CSS?\n\n As variáveis de CSS, que também são chamadas de propriedades customizadas, trazem grandes benefícios e vão funcionar de forma bem semelhante às variáveis de linguagens de programação, ou seja, sua maior função é armazenar valores que serão utilizados posteriormente no código.\n\n Elas permitem criar valores para todas as propriedades de CSS, sendo bastante utilizadas para gerenciar cores, fontes, valores de animações etc.\n\n ### Como utilizar as Variáveis de CSS?\n\n As variáveis de CSS têm acesso ao DOM, o que permite que sejam declaradas globalmente ou localmente. Além disso, possuem uma sintaxe característica que já tivemos um pequeno spoiler na imagem acima. Vamos entender melhor como funciona?\n\n #### Sintaxe\n\n A declaração ou criação de uma variável no arquivo CSS é composta por 4 partes, veja a seguir:\n\n 1. Dois hífens (--)\n\n 2. Nomeação da variável\n\n 3. Dois pontos (:)\n\n 4. Valor da variável\n\n É importante destacar que alguns caracteres não são permitidos na nomeação, como por exemplo: ; # } ] ) etc.\n\n A aplicação das variáveis dentro de um elemento HTML em uma determinada propriedade CSS é feita por meio da associação entre a função var() e o nome da variável, que é passada como parâmetro dentro dos parênteses. Dessa forma:\n\n ```css\n body { \n background: var(--global-primary-color); \n } \n```\n\n #### Declaração global\n\n Fazemos isso declarando a variável dentro da pseudo-classe :root. Esse seletor corresponde à raiz, é o mesmo que <html> em si, só que possui uma especificidade maior. Por meio do :root, estamos disponibilizando elas globalmente, podendo ser utilizadas em qualquer lugar do documento.\n\n #### Declaração local\n\n Para isso, declaramos a variável dentro do seletor que irá utilizá-la. Assim, ficarão restritas ao escopo de onde elas foram declaradas, sendo herdadas apenas pelos elementos filhos.\n\n ### De onde surgiu?\n\n As variáveis são um recurso que durante muitos anos foi bastante solicitado. Isso porque, anteriormente, essa solução só era possível por meio de pré-processadores, como Sass, Stylus ou através de CSS in JS. Esses artifícios atuam como grandes parceiros, mas ainda sim havia algumas lacunas que faltavam ser preenchidas e que somente foram contempladas com as variáveis no CSS.\n\n O principal ponto a se destacar é que as variáveis de pré-processadores são estáticas e necessitam da etapa de compilação, ou seja, todas as funções, mixins e interpolações que ocorrem no Sass retornam CSS puro, para serem interpretadas pelo navegador.\n\n Já as variáveis de CSS funcionam em tempo de execução, são dinâmicas e funcionam de forma independente das tecnologias usadas, atuando em qualquer contexto, sem precisar de etapas adicionais.\n\n Além disso, ocorrem outras limitações com as variáveis de pré-processamento, como por exemplo a impossibilidade de uso de variáveis por meio do @extend nos media queries, a falta de aplicação da herança e efeito cascata nos elementos e, como não há acesso ao DOM, não é possível serem controladas via JavaScript.\n\n ### E quais são as principais vantagens no uso?\n\n #### Código claro\n\n Afinal, ler --cor-principal-bordas é muito mais semântico do que ler #B4E197, onde rapidamente conseguimos entender do que se trata.\n\n #### Favorece a manutenção\n\n É possível alterarmos a folha de estilo em muitos lugares, apenas alterando o valor da variável em um único lugar, o que otimiza o tempo de trabalho e evita que possíveis erros de escrita aconteçam.\n\n #### Criação de temas\n\n Com as variáveis, você pode criar e editar facilmente seus guias de estilos ou construir de maneira mais facilitada temáticas, um exemplo clássico disso é na construção de light/dark mode e, como as variáveis de CSS são dinâmicas e têm acesso ao DOM, é possível ter um controle maior por meio da manipulação via JavaScript.\n\n #### Cascata CSS\n\n São beneficiadas pela cascata do CSS, onde podemos atribuir um novo valor a uma variável, de modo que os elementos filhos irão herdar as características do seu elemento pai mais próximo.\n\n #### Relação com o @media query\n\n Atualmente, ainda não podemos utilizar variáveis como medidas de resolução de tela no @media query, dessa forma:\n\n ```css\n :root { \n --sm: 640px; \n } \n\n @media (max-width: var(--sm)) { \n ... \n } \n```\n\n Ainda é necessário utilizar medidas fixas, mas dentro dos media queries é possível aplicar as variáveis, sem que haja problema algum.\n\n ```css\n :root { \n --color-text-desktop: red; \n --color-text-mobile: blue \n } \n\n h1 { \n color: var(--color-text-desktop); \n } \n\n @media (max-width: 640px) { \n h1 { \n color: var(--color-text-mobile); \n } \n } \n```\n\n ### Suporte ao navegador\n\n Segundo o site Can I use, em relação ao suporte aos navegadores, as variáveis são compatíveis em praticamente todos os navegadores modernos de maneira satisfatória.\n\n ### Agora é com você!\n\n Neste artigo, nós aprendemos sobre o poder do uso das variáveis no CSS em um projeto, entendemos melhor sobre os seus conceitos, vantagens e aplicação.\n\n Agora me conta, você já utilizava as variáveis em sua rotina de desenvolvimento? Se sim, te convido a contar para nós aqui no fórum ou no discord da Diego as suas impressões da prática com elas. E se você nunca tinha ouvido falar ou se este conteúdo te ajudou de alguma forma, não deixe de dar o seu feedback, sua opinião é muito valiosa para nós e nos ajudar a evoluir e te proporcionar cada vez mais uma melhor experiência de aprendizado.\n"
  },
  {
    "id": 6,
    "titulo": "Principais comunidades de Front-end",
    "texto": "Fonte: [Awari](https://awari.com.br/)\n\n Quando entramos na área da tecnologia é como se estivéssemos descobrindo um mundo completamente novo. E, nessa caminhada, você pode se sentir só e sem rumo. Então, para lhe mostrar que não tem apenas você nessa jornada, vou trazer neste artigo algumas comunidades de front-end para que possa conhecer e fazer parte.\n\n ## O que é uma comunidade?\n\n Comunidade é um grupo de pessoas que se reúnem para trocar ideias, dividir experiências e criar eventos (como palestras e workshops, que podem ser presenciais ou on-line). Nesses grupos, diversos temas são debatidos, principalmente sobre as principais demandas do mercado e as tendências da atualidade.\n\n Esses espaços são conhecidos por oferecerem bastante suporte, o que é incrível para quem está começando agora na carreira de dev. Neles, você encontrará desde as pessoas iniciantes até as mais experientes, todas dispostas a ajudar com qualquer dúvida. O fato é que uma pessoa antes de você já pode ter tido perguntas semelhantes às suas e, nesses grupos, você pode encontrar a solução rapidamente.\n\n Além disso, você pode se manter informado sobre as boas práticas, novidades, receber feedbacks, conhecer pessoas novas e se conectar com elas. Aliás, fazer networking é importante em qualquer área, pois, ao se conectar com diferentes tipos de pessoas, você não cresce apenas profissionalmente, mas como indivíduo também.\n\n Há muitas comunidades para pessoas desenvolvedoras por aí. Por isso, neste artigo, irei trazer as principais comunidades voltadas para o Front-end.\n\n Vamos lá?\n\n ## Comunidades do Front-end para fazer parte\n\n ### Stack Overflow\n\n O [Stack Overflow](https://pt.stackoverflow.com/) é um site de perguntas e respostas dedicado a pessoas que já programam ou que querem aprender a programar. A comunidade responde e faz perguntas constantemente, e as pessoas usuárias votam nas melhores para que elas subam no feed e sejam encontradas com mais facilidade. Existem muitas perguntas em inglês, mas, se você quiser, pode ir até a parte que está tudo em português. Legal, né?\n\n Você também ganha reputação quando vota nas suas perguntas e respostas. Em níveis mais altos, você ganha privilégios como a permissão de moderação e passa a ajudar a manter a qualidade do site e da comunidade.\n\n ### GitHub\n\n O GitHub é uma plataforma onde você compartilha seu código e arquivos com controle de versão usando o Git. Ele é como uma rede social para pessoas que programam. Assim, você pode seguir pessoas, trocar mensagens e contribuir em projetos privados ou [Open Source](https://aws.amazon.com/pt/what-is/open-source/).\n\n Apesar do GitHub ter muitas trocas em inglês, vou trazer aqui uma opção maravilhosa em português.\n\n Na plataforma existe um fórum incrível chamado [Front-end Brasil](https://github.com/frontendbr). Ele foi criado com o objetivo de reunir dúvidas vindas de outras redes sociais, como Facebook, mas que acabavam perdidas depois de um tempo. Ou seja, as pessoas criadoras deste espaço queriam unificar todas as discussões em um só local e escolheram, justamente, o GitHub por ser mais fácil de encontrar dúvidas antigas.\n\n Na página principal tem o link que te leva para o fórum, outro para divulgação de vagas na área de Front-end e o terceiro link vai para a parte de eventos. O mais legal é que qualquer pessoa pode adicionar uma vaga, criar um evento ou dar sugestões, desde que esteja dentro das diretrizes do site, claro.\n\n ### MDN Web Docs\n\n O [MDN Web Docs](https://developer.mozilla.org/pt-BR/) é um projeto colaborativo open source que documenta tecnologias de plataforma da Web, como HTML, CSS, JavaScript e APIs da Web. Eles também fornecem uma grande coleção de recursos de aprendizagem para devs e estudantes iniciantes, como uma [trilha de estudos](https://developer.mozilla.org/pt-BR/docs/Learn/Front-end_web_developer) para desenvolvimento front-end, que você pode acessar em inglês ou português. Top, né?\n\n Nessa área, o MDN se propõe a levar você de iniciante a confortável, para que, a partir desse conhecimento básico, você trilhe seu caminho no mundo da programação. E caso você tenha dúvidas ou fique preso em um problema, eles também disponibilizam um fórum para que você poste sua pergunta e outras pessoas possam te ajudar.\n\n ### Coderwall\n\n O [Coderwall](https://coderwall.com/t/web/popular) é uma comunidade de devs para aprender e compartilhar dicas de programação. Há uma seção de dicas específicas para ajudar a resolver problemas ou aprender coisas novas, separadas por tags. Você pode pesquisar “front-end”, por exemplo, e irá encontrar tudo relacionado ao assunto.\n\n Além de existir muitos recursos para iniciantes e devs mais experientes, também há áreas exclusivas para dicas de JavaScript, CSS, HTML, Python, Ruby, iOS e vários outros assuntos, em que você tem total liberdade para perguntar ou postar dicas.\n\n Um ponto importante é que a maior parte do conteúdo é em inglês, mas isso não precisa ser um empecilho, pois você pode usar o recurso de tradução caso queira, como o [Google Tradutor](https://translate.google.com.br/?hl=pt-BR) ou o [DeepL](https://www.deepl.com/translator).\n\n ### WoMakersCode\n\n A [WoMakersCode](https://www.linkedin.com/company/womakerscode/) tem a missão de inspirar e impulsionar meninas e mulheres que desejam ingressar ou se especializar em carreiras ligadas à tecnologia e inovação. Dessa forma, é uma organização que cria várias iniciativas de capacitação, mentoria, empregabilidade e conteúdos digitais. Ou seja, você mulher que se sente sozinha nessa área, onde os homens ainda são maioria, tem a possibilidade de se conectar com outras mulheres e aprender muito com elas.\n\n A organização também disponibiliza várias palestras, workshops e feiras de vagas que você pode se inscrever através [desse link](https://linktr.ee/womakerscode) de forma online e gratuita. E olha só que demais: se quiser, você pode se inscrever para ser palestrante voluntária.\n\n ### She's Tech\n\n A She’s Tech tem três pilares: inspirar, engajar e capacitar. Ela atua pela conscientização do mercado sobre a diversidade, inclusão e estimula a auto-aceleração através da liderança e protagonismo.\n\n Além disso, por meio dela, diversos eventos online e gratuitos são promovidos, onde outras mulheres que já estão atuando na área da tecnologia repassam o que aprenderam durante a vida. Essa comunidade também possui um [grupo no telegram](https://t.me/shestech) para postar e compartilhar oportunidades de trabalho, eventos e cursos para mulheres.\n\n ### Minas Programam\n\n O [Minas Programam](http://minasprogramam.com/) foi criado para desafiar a influência dos estereótipos de gênero e de raça na relação de mulheres com as áreas de ciências, tecnologia e computação, de acordo com as criadoras.\n\n É um projeto que dá oportunidades de aprendizado sobre programação para meninas e mulheres (cis ou trans) e pessoas não-binárias, especialmente aquelas que são negras ou indígenas, por meio de cursos gratuitos, dicas de livros, oficinas e apoio para as futuras devs que não têm um computador para começar a programar.\n\n ### Comunidades Tech\n\n O [Comunidades Tech](https://comunidades.tech/) é um projeto open source, onde você pode pesquisar por vários grupos de tecnologia e filtrar por: categoria, tipo, cidade, país, nome da comunidade, entre outros. Após escolher qual você quer participar, é só clicar para encontrar os links de entrada do grupo, que podem ser no discord, facebook, slack, meetup, telegram, whatsapp e até em podcast.\n\n Você também pode criar seu próprio grupo e cadastrar lá para que outras pessoas encontrem e sua comunidade cresça.\n\n ## Conclusão\n\n Muito legal, né? E você, já participa de comunidades?\n\n Sempre há novidades no mundo da programação e mergulhar em comunidades é muito importante para o seu desenvolvimento como dev. Se você já participa, usufrua de tudo o que ela tem para oferecer, ajude as pessoas, participe de conversas, vá aos encontros e palestras.\n\n Lembrando que se você é estudante da Diego temos a nossa própria comunidade no discord, onde você pode pedir ajuda e ajudar várias pessoas. Todas as pessoas estão sempre dispostas a dar aquela dica incrível ou achar o motivo daquele erro que você não consegue encontrar por nada.\n\n Afinal, ninguém consegue fazer tudo só! Se você ainda não faz parte, venha e se encante.\n\n Agora é com você! Pesquise sobre as comunidades e participe das que gostar mais.\n"
  },
  {
    "id": 7,
    "titulo": "Formulários reativos com Angular",
    "texto": "> Fonte: [Medium](https://medium.com/@rafaasimi/formul%C3%A1rios-reativos-data-driven-fe90d6c85640) \n\n Você já deve ter preenchido um formulário que não indicava claramente o porquê de algum campo não estar válido e teve que ficar adivinhando quantos caracteres sua senha precisava ter ou que tipo de caracteres deveria receber. Ou, em um formulário longo, já ocorreu de preencher apenas os campos que achava serem requeridos e só no final, ao tentar submeter os dados, se deparou com inúmeras mensagens de erro mostrando que diversos outros campos eram obrigatórios? Chato, né? Vem aprender como melhorar essa experiência com o uso das validações customizadas do Angular!\n\n Neste artigo, você vai aprender como:\n\n - Criar um formulário reativo;\n\n - Aplicar validações padrão e criar validações customizadas;\n\n - Mostrar os erros de validação apenas quando o campo for acessado;\n\n - Habilitar o botão de submeter os dados apenas quando o formulário estiver válido.\n\n Vamos lá?\n\n Criar formulários é algo muito comum na rotina de devs front-end. Tanto em formulários mais simples quanto em formulários mais complexos, à medida que a quantidade de campos cresce, é necessário implementar validações.\n\n As validações são importantes para prevenir erros de cadastro e garantir que as informações preenchidas estejam no formato esperado, mas é preciso deixar claro todas as particularidades dos campos a serem preenchidos, a fim de promover uma interação mais dinâmica e amigável das pessoas com nossa aplicação.\n\n ## O que são formulários reativos?\n\n No Angular, existem dois tipos diferentes de formulários: *template driven* e *data driven*. Os do tipo *template driven* são criados e configurados no `component.html`; as validações também são incluídas no template e os valores do formulário são submetidos através da diretiva *ngSubmit*.\n\n Já os formulários *data driven* (orientados a dados) são criados e configurados no `component.ts` e a maior parte do código fica nesse arquivo e não no HTML. Dessa forma, temos um template mais limpo, apenas com a estrutura básica do formulário, já que todas as validações são feitas no componente. No HTML é feita a associação do template ao componente e não precisamos obrigatoriamente do *ngSubmit*.\n\n Fáceis de criar e de dar manutenção, os formulários reativos, como também são conhecidos, são bastante utilizados devido ao seu poder e capacidade de conseguir reagir a mudanças que acontecem no formulário, utilizando observables.\n\n Agora nós vamos entender como podemos criar um formulário reativo e aplicar validações nele.\n\n ## O que precisamos configurar?\n\n Com a aplicação criada, precisamos importar o `ReactiveFormsModule` no arquivo `app.module.ts` e colocar no array de *imports* do `ngModule`, assim:\n\n ```typescript\n import { ReactiveFormsModule } from '@angular/forms';\n\n @NgModule({\n declarations: [\n AppComponent\n ],\n imports: [\n BrowserModule,\n AppRoutingModule,\n ReactiveFormsModule\n ],\n providers: [],\n bootstrap: [AppComponent]\n })\n export class AppModule { }\n ```\n\n Agora, vamos criar no `app.component.ts` uma variável chamada `formulario` do tipo **FormGroup** (deve ser importado também), que é uma classe do Angular que vai nos ajudar na implementação e validação dos forms. Outra classe importante que veremos mais à frente é o **FormControl**.\n\n ```typescript\n import { FormGroup } from '@angular/forms';\n\n formulario: FormGroup;\n ```\n\n A abordagem que vamos utilizar para criar nosso formulário é através da injeção de dependência do *service* **FormBuilder**. Esse serviço fornece métodos para gerar controles de formulários e evita a criação manual de instâncias de controle. Para isso vamos ter que:\n\n - Importar a classe FormBuilder;\n\n - Injetar o service FormBuilder;\n\n - Gerar o conteúdo do formulário.\n\n Vamos criar um formulário com 4 campos:\n\n - nome\n\n - username\n\n - email\n\n - senha\n\n Nosso `app.component.ts` ficará assim:\n\n ```typescript\n import { Component } from '@angular/core';\n import { FormBuilder, FormGroup } from '@angular/forms';\n\n @Component({\n selector: 'app-root',\n templateUrl: './app.component.html',\n styleUrls: ['./app.component.css']\n })\n export class AppComponent {\n formulario: FormGroup;\n\n constructor(private formBuilder: FormBuilder) { }\n\n ngOnInit(): void {\n this.formulario = this.formBuilder.group({\n nome: [''],\n username: [''],\n email: [''],\n senha: ['']\n });\n }\n }\n ```\n\n Também precisamos criar a estrutura do formulário no template com os quatro campos. Agora, antes de implementar as validações, vamos fazer a sincronização do formulário criado no componente com o template para vermos se está tudo certo.\n\n Para isso podemos usar uma diretiva do `ReactiveFormsModule` chamada **formGroup**. E na tag *form* do HTML vamos atribuir a diretiva à nossa variável *formulario* e fazer um *property binding*, porque sempre que o campo for modificado, queremos atualizar e atribuir o valor ao formulário.\n\n ```html\n <form [formGroup]=\"formulario\"></form>\n ```\n\n Para associar cada input utilizamos outra diretiva chamada **formControlName**, fazendo um link entre o campo no HTML e o componente e passando exatamente o nome das variáveis que criamos através do FormBuilder.\n\n ```html\n <input id=\"nome\" type=\"text\" formControlName=\"nome\">\n <input id=\"username\" type=\"text\" formControlName=\"username\">\n <input id=\"email\" type=\"email\" formControlName=\"email\">\n <input id=\"senha\" type=\"password\" formControlName=\"senha\">\n ```\n\n Nosso formulário está assim (estilizado com o [Angular Material](https://material.angular.io/)).\n\n ## Aplicando as validações\n\n Agora, vamos incluir as seguintes validações na aplicação:\n\n - Todos os campos serão de preenchimento obrigatório;\n\n - O campo username aceitará apenas letras minúsculas;\n\n - Verificação do preenchimento correto do formato de e-mail;\n\n - Quantidade mínima de caracteres para a senha será 6.\n\n Para começar, vamos importar a classe **Validators**:\n\n ```typescript\n import { Validators } from '@angular/forms';\n ```\n\n Essa classe já traz vários métodos de validação prontos e fáceis de usar como por exemplo:\n\n - required() - campo de preenchimento obrigatório;\n\n - maxLength() - quantidade máxima de caracteres permitido;\n\n - minLength() - quantidade mínima de caracteres permitido;\n\n - email() - valida o formato de e-mail;\n\n [Veja aqui a lista completa de métodos da classe Validators](https://angular.io/api/forms/Validators).\n\n Agora vamos implementar as validações no formulário, passando os métodos de validação como segundo parâmetro do array criado no `component.ts`.\n\n ```typescript\n ngOnInit(): void {\n this.formulario = this.formBuilder.group({\n nome: ['', [Validators.required]],\n username: ['', [Validators.required]],\n email: ['', [Validators.required, Validators.email]],\n senha: ['', [Validators.required, Validators.minLength(6)]]\n });\n }\n ```\n\n ## Exibindo mensagens de erro\n\n Para exibir mensagens referentes às validações, vamos incluir no HTML, abaixo do input, uma div com a diretiva *ngIf*, passando o formulário e pegando os erros do campo passado como parâmetro, e incluindo a mensagem que queremos apresentar:\n\n ```html\n <div *ngIf=\"formulario.get('nome')?.errors?.['required'] && formulario.get('nome')?.touched\">\n Nome obrigatório\n </div>\n ```\n\n Vamos replicar isso em cada campo e ver o resultado:\n\n Ok, agora as mensagens estão aparecendo, mas já no carregamento inicial da aplicação. Será que existe uma forma mais amigável de apresentá-las? Apenas quando o campo for acessado? Sim! Podemos fazer isso através de uma propriedade do FormControl chamada **touched**. Seu valor inicial é *false* e sempre que o input dispara o evento *onBlur*, ou seja, quando o campo é acessado e perde o foco, a propriedade recebe o valor *true*.\n\n No exemplo do campo *nome* ficará assim:\n\n ```html\n <div *ngIf=\"formulario.get('nome')?.errors?.['required'] && formulario.get('nome')?.touched\">\n Nome obrigatório\n </div>\n ```\n\n Replicando para os outros campos, agora as mensagens de erro aparecem apenas quando necessário.\n\n ## Criando validações customizadas\n\n A validação que queremos incluir para que o campo username receba apenas letras minúsculas não está presente na classe `Validators`. Mas não tem problema, pois é possível criar inúmeras validações customizadas que atendam às suas necessidades.\n\n No nosso exemplo, criamos um arquivo chamado `minusculoValidator.ts`, importamos a classe **AbstractControl** e criamos a lógica da validação.\n\n `minusculoValidator.ts`:\n\n ```typescript\n import { AbstractControl } from '@angular/forms';\n\n export function minusculoValidator(control: AbstractControl) {\n const username = control.value as string;\n if (username !== username?.toLowerCase()) {\n return { minusculo: true };\n } else\n return null;\n }\n ```\n\n Depois disso, importamos a validação no componente e incluímos no array junto com as outras validações.\n\n `app.component.ts`:\n\n ```typescript\n username: ['', [Validators.required, minusculoValidator]],\n ```\n\n `app.component.html`:\n\n ```html\n <div *ngIf=\"formulario.get('username')?.errors?.['minusculo'] && formulario.get('username')?.touched\">\n Esse campo aceita apenas letras minúsculas\n </div>\n ```\n\n Assim, através da propriedade *errors*, podemos criar mensagens customizadas dependendo do erro que seja disparado.\n\n ## Desabilitar/Habilitar o botão\n\n Outro ponto importante é que o botão para envio dos dados está habilitado desde o início, mesmo que os campos não tenham sido preenchidos. Vamos resolver isso?\n\n O formulário possui a propriedade *valid* e podemos fazer um property binding atribuindo-a à propriedade *disabled* do botão e assim criar uma lógica para que o botão fique habilitado apenas quando o formulário estiver válido, ou seja, quando todos os campos forem preenchidos corretamente.\n\n `app.component.html`:\n\n ```html\n <button [disabled]=\"!formulario.valid\">\n Cadastre-se\n </button>\n ```\n"
  },
  {
    "id": 8,
    "titulo": "Svelte ou React?",
    "texto": "> Fonte: [Kinsta](https://kinsta.com/pt/blog/svelte-vs-react/#:~:text=Quando%20se%20trata%20de%20documenta%C3%A7%C3%A3o,eles%20t%C3%AAm%20n%C3%A3o%20%C3%A9%20interativo.)\n\n Inegavelmente, o React é a ferramenta que atualmente domina o mercado front-end, sendo a mais utilizada de acordo com a [pesquisa de 2020 do State of JS](https://2020.stateofjs.com/en-US/technologies/front-end-frameworks/), seguida de seus concorrentes Angular e Vue.js. Essa demanda também é notável quando pesquisamos por vagas em plataformas de empregos.\n\n Porém, uma nova ferramenta vem ganhando força nos últimos anos e superou todas as outras nessa mesma pesquisa no quesito **satisfação**: o Svelte.\n\n ## Mas o que é o Svelte?\n\n O [Svelte](https://svelte.dev/) é um **compilador** utilizado para construir interfaces web, assim como React, Angular e Vue.js. Ele foi criado em 2016 por Rich Harris, e vem com a proposta de ser mais performático, fácil de aprender e utilizar, possuindo uma alta curva de aprendizagem, além da sintaxe simples e intuitiva.\n\n O Svelte em si é muito leve: [4.4kB, ou 1.6 kB comprimido](https://bundlephobia.com/package/svelte@3.43.2), custando muito menos para os navegadores baixarem os arquivos. Para comparação, os pacotes [react](https://bundlephobia.com/package/react@17.0.2) e [react-dom](https://bundlephobia.com/package/react@17.0.2), juntos, somam 126kB, ou 42.2kB comprimidos.\n\n ## Como funciona um compilador no front-end?\n\n O compilador do Svelte lê o código que escrevemos e o **compila** para JavaScript puro, [sem utilizar Virtual DOM](https://svelte.dev/blog/virtual-dom-is-pure-overhead). O código gerado é [extremamente performático](https://krausest.github.io/js-framework-benchmark/2022/table_chrome_99.0.4844.51.html) em relação aos seus concorrentes.\n\n Você também pode ver o processo de compilação na prática, utilizando o [REPL](https://svelte.dev/repl/hello-world), uma ferramenta criada pelo Svelte, onde podemos testar nossos códigos online e ver os arquivos JS gerados.\n\n > Dica: utilize o REPL para testar os exemplos deste artigo!\n\n Agora que você entende como funciona o Svelte e o quão performático ele é, vamos compará-lo com o React, com alguns exemplos de código!\n\n ## Comparação de código Svelte vs React\n\n ### Estrutura de um componente\n\n Vamos considerar o seguinte código React:\n\n ```javascript\n import './App.css';\n import { useState } from 'react';\n\n function App() {\n const [nome, setNome] = useState('World');\n\n return (\n <div className=\"App\">\n <h1>Hello {nome}!</h1>\n </div>\n );\n }\n\n export default App;\n ```\n\n Com o Svelte, o mesmo código acima ficaria assim:\n\n ```html\n <script>\n let nome = 'World';\n </script>\n\n <main>\n <h1>Hello {nome}!</h1>\n </main>\n\n <style>\n main {\n /* estilos de main */\n }\n\n h1 {\n /* estilos de h1 */\n }\n </style>\n ```\n\n O Svelte utiliza a estrutura **Single File Component** (Componente de Arquivo Único), onde deixamos HTML, CSS e JS em um mesmo arquivo com extensão `.svelte`. Vemos no exemplo acima que o JS fica dentro da tag `<script>`, o CSS dentro da `<style>` e o HTML não precisa ser delimitado por alguma tag. Além disso, essas partes podem vir em qualquer ordem, então o código abaixo também é válido:\n\n ```html\n <style>\n h1 {\n /* estilos de h1 */\n }\n </style>\n\n <h1>Hello {nome}!</h1>\n <p>\n Minha primeira aplicação Svelte!\n </p>\n\n <script>\n let nome = 'World';\n </script>\n ```\n\n Note também que o HTML do componente não precisa ser envolto por uma tag, como no exemplo acima, que utilizamos as tags `<h1>` e `<p>`.\n\n ### Estado\n\n Em React, para criarmos um estado, precisamos explicitá-lo no código utilizando `useState`. Já no Svelte, qualquer variável que criamos com a palavra-chave `let` se torna um estado por padrão.\n\n Ainda, em React, se quisermos alterar o estado `nome` para um novo valor no clique de um botão, podemos escrever o seguinte:\n\n ```javascript\n <button onClick={() => setNome('Diego')} disabled={nome === 'Diego'}>\n Alterar nome\n </button>\n ```\n\n O código acima ficaria assim em Svelte:\n\n ```html\n <button on:click={() => nome = 'Diego'} disabled={nome === 'Diego'}>\n Alterar nome\n </button>\n ```\n\n Repare que utilizamos a diretiva [on:](https://svelte.dev/tutorial/dom-events) para escutar o evento de `click` do botão. Note também que precisamos apenas fazer uma atribuição direta ao estado `nome`, e a interface do componente será re-renderizada de acordo com a mudança. Trata-se de uma sintaxe intuitiva e prática, especialmente quando trabalhamos com objetos e arrays.\n\n > Diretivas são como “atributos especiais” que colocamos em tags do HTML. Elas já são conhecidas em Angular e Vue.js, e são um recurso poderoso que podem nos ajudar de diversas formas no nosso desenvolvimento.\n\n ### Two-way data binding\n\n Vamos criar um input que altera o estado `nome` que criamos no código React, utilizando a função `setNome`:\n\n ```javascript\n <input\n type=\"text\"\n value={nome}\n onChange={(e) => setNome(e.target.value)}\n />\n ```\n\n Note que precisamos declarar o atributo `value={nome}` para que o estado defina o valor inicial do campo, e também declarar o atributo `onChange={(e) => setNome(e.target.value)}` para que as alterações no campo alterem o estado também.\n\n No Svelte, podemos simplificar essas operações utilizando a seguinte sintaxe:\n\n ```html\n <input type=\"text\" bind:value={nome} />\n ```\n\n Usamos a diretiva [bind:](https://svelte.dev/tutorial/text-inputs) para fazer um **Two-way data binding** (Ligação de dados bidirecional) que, nesse caso, serve para **ligar** (ou **vincular**) um atributo do HTML a um estado. Dessa forma, o atributo `value` e o estado `nome` sempre possuirão o mesmo valor.\n\n ### Estilos escopados\n\n No React, por padrão, os estilos não são escopados, ou seja, se arquivos CSS declararem estilos para um mesmo seletor, esses estilos irão interferir entre si. Soluções possíveis são utilizar módulos CSS ou Styled Components.\n\n Já no Svelte, os estilos são [**escopados por padrão**](https://svelte.dev/docs#component-format-style), pois esse é o comportamento que geralmente queremos. Se, por acaso, precisarmos que algum estilo seja global para todos os componentes, podemos escrever a seguinte sintaxe:\n\n ```css\n :global(h1) {\n /* estilos de h1 */\n }\n ```\n\n Utilizamos o modificador `:global()` e, dentro dos parênteses, colocamos o seletor CSS que queremos globalizar.\n\n ### Estrutura de condição\n\n No React, combinamos o JS com JSX para renderizar HTML de forma condicional, como nesse código:\n\n ```javascript\n {\n nome === 'Diego'\n ? <p>É meu nome!</p>\n : <p>Não é meu nome...</p>\n }\n ```\n\n Diferentemente, no Svelte, temos uma estrutura dedicada para essas situações, e o código ficaria assim:\n\n ```html\n {#if nome === 'Diego'}\n <p>É meu nome!</p>\n {:else}\n <p>Não é meu nome...</p>\n {/if}\n ```\n\n Esse é o bloco [#if](https://svelte.dev/tutorial/if-blocks) do Svelte, e pode ser utilizado, opcionalmente, com cláusulas `:else if` e `:else`.\n\n ### Estrutura de repetição\n\n Em React, podemos combinar o JS com JSX para iterar sobre alguma lista e renderizar HTML de acordo com ela. Considere que temos um estado chamado `numeros`, que é um array do JavaScript. Para imprimir um parágrafo para cada item do array, faríamos algo assim:\n\n ```javascript\n {numeros.map((numero) => (\n <p>Número: {numero}</p>\n ))}\n ```\n\n Já no Svelte, temos uma estrutura dedicada para esses casos, e nosso código ficaria assim:\n\n ```html\n {#each numeros as numero}\n <p>Número: {numero}</p>\n {/each}\n ```\n\n Esse é o bloco [#each](https://svelte.dev/tutorial/else-blocks) do Svelte e ele pode até ser utilizado junto com uma cláusula `:else`, que mostra um HTML caso a lista esteja vazia.\n\n > Note que esses blocos especiais sempre começam com `#`, “continuam” com `:` (quando há cláusulas) e terminam em `/`.\n\n ### Código reativo\n\n Às vezes, no nosso código, é útil guardar valores que dependem de algum estado do componente. Em React, logo após a declaração do estado `nome`, poderíamos adicionar o seguinte código:\n\n ```javascript\n const meuNome = nome === 'Diego';\n ```\n\n Assim, podemos utilizar `meuNome` no botão e no condicional:\n\n ```javascript\n <button onClick={() => setNome('Diego')} disabled={meuNome}>\n Alterar nome\n </button>\n\n {\n meuNome\n ? <p>É meu nome!</p>\n : <p>Não é meu nome...</p>\n }\n ```\n\n Dessa forma, evitamos repetição de código, além de aumentarmos a legibilidade e a facilidade de manutenção. Entretanto, o código `const meuNome = nome === 'Diego';` é executado sempre que o componente é re-renderizado, mesmo que essa renderização tenha sido causada por um estado que não fosse `nome`.\n\n Por outro lado, no Svelte, todo o código dentro da tag `<script>` é executado uma única vez, quando o componente é renderizado pela primeira vez na tela. Então, como faríamos para replicar a situação acima?\n\n Na tag `<script>`, podemos adicionar o seguinte código:\n\n ```html\n $: meuNome = nome === 'Diego';\n ```\n\n Assim, no HTML, podemos utilizar `meuNome`:\n\n ```html\n <button on:click={() => nome = 'Diego'} disabled={meuNome}>\n Alterar nome\n </button>\n\n {#if meuNome}\n <p>É meu nome!</p>\n {:else}\n <p>Não é meu nome...</p>\n {/if}\n ```\n\n A sintaxe [$:](https://svelte.dev/tutorial/reactive-statements) indica que um código deve ser reativo! O Svelte identifica quais estados estão sendo utilizados nessa sintaxe e executa o código quando algum desses estados é alterado. Assim, `meuNome = nome === 'Diego'` é executado somente quando o estado `nome` for alterado.\n\n > Se você já trabalhou com Vue.js, talvez tenha lembrado das *computed properties* (propriedades computadas). De fato, a “sintaxe de dólar” funciona praticamente da mesma forma.\n\n ### E não para por aí…\n\n Fizemos a comparação entre conceitos fundamentais do Svelte e do React, mas ainda levaríamos vários artigos para cobrirmos mais diferenças importantes! Algumas delas:\n\n - **Comunicação entre componentes**: no React, a comunicação básica entre componentes se dá de forma unidirecional e sempre do pai para o filho, através de props. Já o Svelte fornece várias opções pra gente, como props, [dispatch](https://svelte.dev/tutorial/component-events) (filho para o pai) e [bind](https://svelte.dev/tutorial/component-bindings) (comunicação bidirecional).\n\n - **Composição de componentes**: no React, para passarmos conteúdos mais complexos para um componente filho, podemos utilizar `children`. No Svelte, utilizamos o [`slot`](https://svelte.dev/tutorial/slots), que nos dá uma grande variedade de recursos, como definir um conteúdo padrão (*fallback*), configurar o recebimento de mais de um conteúdo (*named slots*), entre outros.\n\n - **Métodos de ciclo de vida**: na abordagem funcional do React, o controle dos ciclos de vida de um componente é unificado no hook `useEffect()`. O Svelte prefere separar essas responsabilidades em [diferentes métodos](https://svelte.dev/tutorial/onmount): `onMount()`, `beforeUpdate()`, `afterUpdate()` e `onDestroy()`. Mas também temos a opção de retornar uma função para o método `onMount()`, e ela será executada quando o componente for destruído, ou seja, como se ela estivesse no método `onDestroy()`.\n\n - **Gerenciamento de estado**: no React, podemos optar pela solução nativa, a Context API, ou alguma biblioteca externa, como Redux. No Svelte, temos duas soluções nativas: as [Stores](https://svelte.dev/tutorial/writable-stores), para gerenciamento de estado global, e uma [Context API](https://svelte.dev/tutorial/context-api) também, para casos mais específicos.\n\n ## Resumindo, Svelte é melhor que React?\n\n Apesar de todos os benefícios citados, o Svelte ainda é uma **tecnologia em ascensão**, e não possui tantas oportunidades de emprego quanto seus concorrentes.\n\n Por outro lado, ele já é utilizado por empresas como Spotify, The New York Times, Avast, Philips, e outras, como podemos ver na [página principal do Svelte](https://svelte.dev/) e [nessa página da extensão Wappalyzer](https://www.wappalyzer.com/technologies/javascript-frameworks/svelte), que analisa quais sites utilizam determinada tecnologia.\n\n O React ainda lidera o mercado e as vagas de emprego. Mas nós, pessoas desenvolvedoras front-end, devemos sempre nos manter atualizadas de novas tecnologias, principalmente, quando possuem um grande potencial de crescimento, como o Svelte. Além disso, estudar diferentes ferramentas front-end é uma excelente forma de reforçar conceitos e de apurar nosso senso crítico, fazendo-nos questionar as decisões que foram tomadas na construção de uma determinada tecnologia.\n\n Para conferir todos os recursos do Svelte citados neste artigo, você pode visitar o [tutorial](https://svelte.dev/tutorial/basics) ou a [documentação](https://svelte.dev/docs).\n"
  }
]
